#include<iostream>
using namespace std;

#define tab "\t"

void FillRand(int** arr, const int m, const int n);
void Print(int** arr, const int m, const int n);

void main()
{
	setlocale(LC_ALL, "");
	int m; // Количество строк
	int n; // Количество столбцов

	cout << "Введите количество строк: "; cin >> m;
	cout << "Введите количество элементов строки (столбцов): "; cin >> n;

	////////////////////////////////////////////////////////////////////////////
	/////////////   Объявление двумерного динамического массива   //////////////
	////////////////////////////////////////////////////////////////////////////
	// Чтотбы объявить двумерный динамический массив нужно объявить указатель на указатель
	//1) Создаем массив указателей:
	int** arr = new int* [m] {};
	// new int*[m] - выделить память для m элементов типа указатель на int
	//2) Выделяем память под строки двумерного массива:
	// Для этого нужно обратиться к каждому элементу массива указателей
	for (int i = 0; i < m; i++)
	{
		// Создаем строки
		arr[i] = new int[n] {}; //new int[n] - new выделяет память для n элементов типа int
	}
	////////////////////////////////////////////////////////////////////////////
	/////////////   Использование двумерного динамического массива   ///////////
	////////////////////////////////////////////////////////////////////////////
	//Обращаться к элементам двумерного динамического массива можно точно так-же
	//как и к элеметам двумерного статического массива через двойные [][] скобки

	FillRand(arr, m, n);
	Print(arr, m, n);

	////////////////////////////////////////////////////////////////////////////
	///////////////////   Удаление динамического массива   /////////////////////
	////////////////////////////////////////////////////////////////////////////
	//Выполняется в 2 этапа, сначала удаляются строки:
	//1) Удаляем строки массива:
	for (int i = 0; i < m; i++)
	{
		delete[] arr[i];
	}
	//2) Удаляем массив указателей:
	delete[] arr;
}

void FillRand(int** arr, const int m, const int n)
{
	for (int i = 0; i < m; i++) //Оператор индексирования
	{
		//Вложенный цикл
		for (int j = 0; j < n; j++) //n - это количество столбиков
		{
			arr[i][j] = rand() % 100;
		}
	}
}

void Print(int** arr, const int m, const int n)
{
	for (int i = 0; i < m; i++)
	{
		for (int j = 0; j < n; j++)
		{
			cout << arr[i][j] << tab;
		}
		cout << endl;
	}
}
// void push_row_back(...);  добавить строку в конец
// void push_row_front(...); добавить строку в начало
// void pop_row_back(...);   удаление строки в конце
// void pop_row_front(...);  удалеет строку в начале
// void insert_row(...);     вставить строку по индексу
// void erase_row(...);      удаляет строку по индексу